from enum import Enum


class ServerCode(Enum):
    CODE41001 = 41001  # 未查询到大厅
    CODE41002 = 41002  # 当阶段不允许
    CODE41003 = 41003  # 未查询到玩家
    CODE41004 = 41004  # 金额不正确
    CODE41005 = 41005  # 类型不正确
    CODE41006 = 41006  # 参数不正确
    CODE41007 = 41007  # 玩家金额不足


class ServerMsg(Enum):
    CODE41001 = "未查询到大厅"  # 未查询到大厅
    CODE41002 = "当阶段不允许"  # 当阶段不允许
    CODE41003 = "未查询到玩家"  # 未查询到玩家
    CODE41004 = "金额不正确"    # 金额不正确
    CODE41005 = "类型不正确"    # 类型不正确
    CODE41006 = "类型不正确"    # 参数不正确
    CODE41007 = "玩家金额不足"  # 玩家金额不足

