from enum import Enum


class ResultCode(Enum):
    """
        状态码约定
        20000~29999：为请求成功的状态
        40000~49999：为客户端提交的引起的错误
        50000~59999: 为服务端处理异常
        51000~51999: 为视图层错误
        52000~52999: 为业务层错误
        53000~53999: 为持久层错误
        60000~69999: 逻辑业务码
    """
    CODE_20000 = 20000  # 请求成功

    CODE_40000 = 40000  # 前台参数错误
    CODE_40001 = 40001  # 身份验证异常
    CODE_40003 = 40003  # 验证不通过
    CODE_40004 = 40004  # 参数错误
    CODE_40005 = 40005  # 查询日志不存在
    CODE_40006 = 40006  # 短信验证码错误
    CODE_40007 = 40007  # 手机号格式错误
    CODE_40008 = 40008  # 手机号不存在
    CODE_40009 = 40009  # 请勿重复发送

    CODE_50000 = 50000  # 服务端错误

    CODE_51000 = 51000  # 视图层错误

    CODE_52000 = 52000  # 业务层错位

    CODE_53000 = 53000  # 持久层层错
    CODE_53001 = 53001  # 未查询到

    CODE_60000 = 60000  # 账号密码错误
    CODE_60001 = 60001  # 角色名重复
    CODE_60002 = 60002  # 角色被占用
    CODE_60003 = 60003  # 重复签到
    CODE_60004 = 60004  # 名称重复
    CODE_60005 = 60005  # 余额不足
    CODE_60006 = 60006  # 审核失败
    CODE_60007 = 60007  # 大厅未开启
    CODE_60008 = 60008  # 充值失败
    CODE_60009 = 60009  # 大厅未结束

    CODE_61001 = 61001  # 签名错误
    CODE_61002 = 61002  # 创建订单失败
    CODE_61003 = 61003  # 创建订单失败

    CODE_62000 = 62000  # 未查询到该订单
    CODE_62001 = 62001  # 订单过期


class ResultMsg(Enum):
    MSG_20000 = "Succeed"  # 请求成功

    MSG_40000 = "参数不符合规范"  # 前台参数错误
    MSG_40001 = "身份验证异常"  # 身份验证异常
    MSG_40003 = "验证不通过"  # 前台参数错误
    MSG_40004 = "amount应该是一个正整数"  # 前台参数错误
    MSG_40005 = "查询日志不存在"  # 查询日志不存在
    MSG_40006 = "短信验证码错误"  # 短信验证码错误
    MSG_40007 = "手机号格式错误"  # 手机号格式错误
    MSG_40008 = "手机号不存在"  # 手机号不存在
    MSG_40009 = "请勿重复发送"  # 请勿重复发送

    MSG_50000 = "服务器错误"  # 服务端错误

    MSG_51000 = "视图层错误"  # 视图层错误

    MSG_52000 = "业务层错位"  # 业务层错位

    MSG_53000 = "持久层层错"  # 持久层层错
    MSG_53001 = "未查询到"    # 未查询到

    MSG_60000 = "账号密码错误"        # 账号密码错误
    MSG_60001 = "用户名重复"          # 角色名重复
    MSG_60002 = "角色被占用不能删除"   # 角色名重复
    MSG_60003 = "重复签到"            # 重复签到
    MSG_60004 = "名称重复"            # 名称重复
    MSG_60005 = "余额不足"            # 余额不足
    MSG_60006 = "审核失败,请重试"     # 审核失败
    MSG_60007 = "大厅未开启"         # 大厅未开启
    MSG_60008 = "充值失败"  # 充值失败
    MSG_60009 = "大厅未结束"  # 充值失败

    MSG_61001 = "签名错误"            # 签名错误
    MSG_61002 = "创建订单失败"        # 创建订单失败
    MSG_61003 = "未获取到可用账户"  # 创建订单失败

    MSG_62000 = "未查询到该订单"      # 未查询到该订单
    MSG_62001 = "订单过期"          # 订单过期

